#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
aws_acm_certificate_validation.resume: Refreshing state... [id=0001-01-01 00:00:00 +0000 UTC]
aws_acm_certificate.resume: Refreshing state... [id=arn:aws:acm:us-east-1:085879623427:certificate/2ca2a373-e4f8-4651-b6f1-772b2d031932]
aws_cloudfront_origin_access_control.resume: Refreshing state... [id=EDLCUHWWEP6SJ]
aws_s3_object.resume_website["index.html"]: Refreshing state... [id=index.html]
aws_s3_bucket_policy.allow_cloudfront_access: Refreshing state... [id=dbornitz-resume]
aws_s3_bucket_public_access_block.resume: Refreshing state... [id=dbornitz-resume]
aws_s3_bucket_website_configuration.resume: Refreshing state... [id=dbornitz-resume]
aws_s3_object.resume_website["styles.css"]: Refreshing state... [id=styles.css]
aws_cloudfront_distribution.resume: Refreshing state... [id=E171XCBLMPI257]
aws_s3_bucket.resume: Refreshing state... [id=dbornitz-resume]
aws_route53_zone.davidbornitz_dev: Refreshing state... [id=Z0139625NTMWYZJ47N1B]
aws_route53_record.resume: Refreshing state... [id=Z0139625NTMWYZJ47N1B_resume.davidbornitz.dev_A]
aws_route53_record.resume_validation["*.davidbornitz.dev"]: Refreshing state... [id=Z0139625NTMWYZJ47N1B__b5bd274a26f04dfbb4c9106ec8c08bb5.davidbornitz.dev._CNAME]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy
 <= read (data resources)

Terraform will perform the following actions:

  # aws_acm_certificate.davidbornitz will be created
  + resource "aws_acm_certificate" "davidbornitz" {
      + arn                       = (known after apply)
      + domain_name               = "*.davidbornitz.dev"
      + domain_validation_options = [
          + {
              + domain_name           = "*.davidbornitz.dev"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + key_algorithm             = (known after apply)
      + not_after                 = (known after apply)
      + not_before                = (known after apply)
      + pending_renewal           = (known after apply)
      + renewal_eligibility       = (known after apply)
      + renewal_summary           = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = [
          + "*.davidbornitz.dev",
        ]
      + tags_all                  = (known after apply)
      + type                      = (known after apply)
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"

      + options {
          + certificate_transparency_logging_preference = (known after apply)
        }
    }

  # aws_acm_certificate.resume will be destroyed
  # (because aws_acm_certificate.resume is not in configuration)
  - resource "aws_acm_certificate" "resume" {
      - arn                       = "arn:aws:acm:us-east-1:085879623427:certificate/2ca2a373-e4f8-4651-b6f1-772b2d031932" -> null
      - domain_name               = "*.davidbornitz.dev" -> null
      - domain_validation_options = [
          - {
              - domain_name           = "*.davidbornitz.dev"
              - resource_record_name  = "_b5bd274a26f04dfbb4c9106ec8c08bb5.davidbornitz.dev."
              - resource_record_type  = "CNAME"
              - resource_record_value = "_3cf0f476cd05c2b37e15837f699abc5c.mhbtsbpdnt.acm-validations.aws."
            },
        ] -> null
      - id                        = "arn:aws:acm:us-east-1:085879623427:certificate/2ca2a373-e4f8-4651-b6f1-772b2d031932" -> null
      - key_algorithm             = "RSA_2048" -> null
      - not_after                 = "2025-02-14T23:59:59Z" -> null
      - not_before                = "2024-01-17T00:00:00Z" -> null
      - pending_renewal           = false -> null
      - renewal_eligibility       = "ELIGIBLE" -> null
      - renewal_summary           = [] -> null
      - status                    = "ISSUED" -> null
      - subject_alternative_names = [
          - "*.davidbornitz.dev",
        ] -> null
      - tags                      = {} -> null
      - tags_all                  = {} -> null
      - type                      = "AMAZON_ISSUED" -> null
      - validation_emails         = [] -> null
      - validation_method         = "DNS" -> null

      - options {
          - certificate_transparency_logging_preference = "ENABLED" -> null
        }
    }

  # aws_acm_certificate_validation.davidbornitz will be created
  + resource "aws_acm_certificate_validation" "davidbornitz" {
      + certificate_arn         = (known after apply)
      + id                      = (known after apply)
      + validation_record_fqdns = (known after apply)
    }

  # aws_acm_certificate_validation.resume will be destroyed
  # (because aws_acm_certificate_validation.resume is not in configuration)
  - resource "aws_acm_certificate_validation" "resume" {
      - certificate_arn         = "arn:aws:acm:us-east-1:085879623427:certificate/2ca2a373-e4f8-4651-b6f1-772b2d031932" -> null
      - id                      = "0001-01-01 00:00:00 +0000 UTC" -> null
      - validation_record_fqdns = [
          - "_b5bd274a26f04dfbb4c9106ec8c08bb5.davidbornitz.dev",
        ] -> null
    }

  # aws_cloudfront_distribution.davidbornitz will be created
  + resource "aws_cloudfront_distribution" "davidbornitz" {
      + aliases                         = [
          + "davidbornitz.dev",
          + "resume.davidbornitz.dev",
        ]
      + arn                             = (known after apply)
      + caller_reference                = (known after apply)
      + continuous_deployment_policy_id = (known after apply)
      + default_root_object             = "index.html"
      + domain_name                     = (known after apply)
      + enabled                         = true
      + etag                            = (known after apply)
      + hosted_zone_id                  = (known after apply)
      + http_version                    = "http2"
      + id                              = (known after apply)
      + in_progress_validation_batches  = (known after apply)
      + is_ipv6_enabled                 = true
      + last_modified_time              = (known after apply)
      + price_class                     = "PriceClass_All"
      + retain_on_delete                = false
      + staging                         = false
      + status                          = (known after apply)
      + tags_all                        = (known after apply)
      + trusted_key_groups              = (known after apply)
      + trusted_signers                 = (known after apply)
      + wait_for_deployment             = true

      + default_cache_behavior {
          + allowed_methods        = [
              + "GET",
              + "HEAD",
            ]
          + cached_methods         = [
              + "GET",
              + "HEAD",
            ]
          + compress               = false
          + default_ttl            = 3600
          + max_ttl                = 86400
          + min_ttl                = 0
          + target_origin_id       = "resume"
          + trusted_key_groups     = (known after apply)
          + trusted_signers        = (known after apply)
          + viewer_protocol_policy = "allow-all"

          + forwarded_values {
              + headers                 = (known after apply)
              + query_string            = false
              + query_string_cache_keys = (known after apply)

              + cookies {
                  + forward           = "none"
                  + whitelisted_names = (known after apply)
                }
            }
        }

      + origin {
          + connection_attempts      = 3
          + connection_timeout       = 10
          + domain_name              = (known after apply)
          + origin_access_control_id = (known after apply)
          + origin_id                = (known after apply)
        }
      + origin {
          + connection_attempts      = 3
          + connection_timeout       = 10
          + domain_name              = (known after apply)
          + origin_access_control_id = (known after apply)
          + origin_id                = (known after apply)
        }

      + restrictions {
          + geo_restriction {
              + locations        = (known after apply)
              + restriction_type = "none"
            }
        }

      + viewer_certificate {
          + acm_certificate_arn      = (known after apply)
          + minimum_protocol_version = "TLSv1.2_2021"
          + ssl_support_method       = "sni-only"
        }
    }

  # aws_cloudfront_distribution.resume will be destroyed
  # (because aws_cloudfront_distribution.resume is not in configuration)
  - resource "aws_cloudfront_distribution" "resume" {
      - aliases                        = [
          - "resume.davidbornitz.dev",
        ] -> null
      - arn                            = "arn:aws:cloudfront::085879623427:distribution/E171XCBLMPI257" -> null
      - caller_reference               = "terraform-20240117190815760000000001" -> null
      - default_root_object            = "index.html" -> null
      - domain_name                    = "d3otvmrdt81gt1.cloudfront.net" -> null
      - enabled                        = true -> null
      - etag                           = "E27CHIBSD1OYCF" -> null
      - hosted_zone_id                 = "Z2FDTNDATAQYW2" -> null
      - http_version                   = "http2" -> null
      - id                             = "E171XCBLMPI257" -> null
      - in_progress_validation_batches = 0 -> null
      - is_ipv6_enabled                = true -> null
      - last_modified_time             = "2024-01-17 19:08:16.088 +0000 UTC" -> null
      - price_class                    = "PriceClass_All" -> null
      - retain_on_delete               = false -> null
      - staging                        = false -> null
      - status                         = "Deployed" -> null
      - tags                           = {} -> null
      - tags_all                       = {} -> null
      - trusted_key_groups             = [
          - {
              - enabled = false
              - items   = []
            },
        ] -> null
      - trusted_signers                = [
          - {
              - enabled = false
              - items   = []
            },
        ] -> null
      - wait_for_deployment            = true -> null

      - default_cache_behavior {
          - allowed_methods        = [
              - "GET",
              - "HEAD",
            ] -> null
          - cached_methods         = [
              - "GET",
              - "HEAD",
            ] -> null
          - compress               = false -> null
          - default_ttl            = 3600 -> null
          - max_ttl                = 86400 -> null
          - min_ttl                = 0 -> null
          - smooth_streaming       = false -> null
          - target_origin_id       = "resume" -> null
          - trusted_key_groups     = [] -> null
          - trusted_signers        = [] -> null
          - viewer_protocol_policy = "allow-all" -> null

          - forwarded_values {
              - headers                 = [] -> null
              - query_string            = false -> null
              - query_string_cache_keys = [] -> null

              - cookies {
                  - forward           = "none" -> null
                  - whitelisted_names = [] -> null
                }
            }
        }

      - origin {
          - connection_attempts      = 3 -> null
          - connection_timeout       = 10 -> null
          - domain_name              = "dbornitz-resume.s3.us-east-2.amazonaws.com" -> null
          - origin_access_control_id = "EDLCUHWWEP6SJ" -> null
          - origin_id                = "resume" -> null
        }

      - restrictions {
          - geo_restriction {
              - locations        = [] -> null
              - restriction_type = "none" -> null
            }
        }

      - viewer_certificate {
          - acm_certificate_arn            = "arn:aws:acm:us-east-1:085879623427:certificate/2ca2a373-e4f8-4651-b6f1-772b2d031932" -> null
          - cloudfront_default_certificate = false -> null
          - minimum_protocol_version       = "TLSv1.2_2021" -> null
          - ssl_support_method             = "sni-only" -> null
        }
    }

  # aws_cloudfront_origin_access_control.davidbornitz will be created
  + resource "aws_cloudfront_origin_access_control" "davidbornitz" {
      + description                       = "Allow Only Cloudfront"
      + etag                              = (known after apply)
      + id                                = (known after apply)
      + name                              = "davidbornitz"
      + origin_access_control_origin_type = "s3"
      + signing_behavior                  = "always"
      + signing_protocol                  = "sigv4"
    }

  # aws_cloudfront_origin_access_control.resume will be destroyed
  # (because aws_cloudfront_origin_access_control.resume is not in configuration)
  - resource "aws_cloudfront_origin_access_control" "resume" {
      - description                       = "Allow Only Cloudfront" -> null
      - etag                              = "ETVPDKIKX0DER" -> null
      - id                                = "EDLCUHWWEP6SJ" -> null
      - name                              = "resume" -> null
      - origin_access_control_origin_type = "s3" -> null
      - signing_behavior                  = "always" -> null
      - signing_protocol                  = "sigv4" -> null
    }

  # aws_route53_record.cert_validation["*.davidbornitz.dev"] will be created
  + resource "aws_route53_record" "cert_validation" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = (known after apply)
    }

  # aws_route53_record.record["davidbornitz.dev"] will be created
  + resource "aws_route53_record" "record" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "davidbornitz.dev"
      + type            = "A"
      + zone_id         = (known after apply)

      + alias {
          + evaluate_target_health = false
          + name                   = (known after apply)
          + zone_id                = (known after apply)
        }
    }

  # aws_route53_record.record["resume.davidbornitz.dev"] will be created
  + resource "aws_route53_record" "record" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "resume.davidbornitz.dev"
      + type            = "A"
      + zone_id         = (known after apply)

      + alias {
          + evaluate_target_health = false
          + name                   = (known after apply)
          + zone_id                = (known after apply)
        }
    }

  # aws_route53_record.resume will be destroyed
  # (because aws_route53_record.resume is not in configuration)
  - resource "aws_route53_record" "resume" {
      - fqdn                             = "resume.davidbornitz.dev" -> null
      - id                               = "Z0139625NTMWYZJ47N1B_resume.davidbornitz.dev_A" -> null
      - multivalue_answer_routing_policy = false -> null
      - name                             = "resume.davidbornitz.dev" -> null
      - records                          = [] -> null
      - ttl                              = 0 -> null
      - type                             = "A" -> null
      - zone_id                          = "Z0139625NTMWYZJ47N1B" -> null

      - alias {
          - evaluate_target_health = false -> null
          - name                   = "d3otvmrdt81gt1.cloudfront.net" -> null
          - zone_id                = "Z2FDTNDATAQYW2" -> null
        }
    }

  # aws_route53_record.resume_validation["*.davidbornitz.dev"] will be destroyed
  # (because aws_route53_record.resume_validation is not in configuration)
  - resource "aws_route53_record" "resume_validation" {
      - allow_overwrite                  = true -> null
      - fqdn                             = "_b5bd274a26f04dfbb4c9106ec8c08bb5.davidbornitz.dev" -> null
      - id                               = "Z0139625NTMWYZJ47N1B__b5bd274a26f04dfbb4c9106ec8c08bb5.davidbornitz.dev._CNAME" -> null
      - multivalue_answer_routing_policy = false -> null
      - name                             = "_b5bd274a26f04dfbb4c9106ec8c08bb5.davidbornitz.dev" -> null
      - records                          = [
          - "_3cf0f476cd05c2b37e15837f699abc5c.mhbtsbpdnt.acm-validations.aws.",
        ] -> null
      - ttl                              = 60 -> null
      - type                             = "CNAME" -> null
      - zone_id                          = "Z0139625NTMWYZJ47N1B" -> null
    }

  # aws_route53_zone.davidbornitz will be created
  + resource "aws_route53_zone" "davidbornitz" {
      + arn                 = (known after apply)
      + comment             = "Managed by Terraform"
      + force_destroy       = false
      + id                  = (known after apply)
      + name                = "davidbornitz.dev"
      + name_servers        = (known after apply)
      + primary_name_server = (known after apply)
      + tags_all            = (known after apply)
      + zone_id             = (known after apply)
    }

  # aws_route53_zone.davidbornitz_dev will be destroyed
  # (because aws_route53_zone.davidbornitz_dev is not in configuration)
  - resource "aws_route53_zone" "davidbornitz_dev" {
      - arn                 = "arn:aws:route53:::hostedzone/Z0139625NTMWYZJ47N1B" -> null
      - comment             = "Managed by Terraform" -> null
      - force_destroy       = false -> null
      - id                  = "Z0139625NTMWYZJ47N1B" -> null
      - name                = "davidbornitz.dev" -> null
      - name_servers        = [
          - "ns-1270.awsdns-30.org",
          - "ns-1593.awsdns-07.co.uk",
          - "ns-207.awsdns-25.com",
          - "ns-671.awsdns-19.net",
        ] -> null
      - primary_name_server = "ns-207.awsdns-25.com" -> null
      - tags                = {} -> null
      - tags_all            = {} -> null
      - zone_id             = "Z0139625NTMWYZJ47N1B" -> null
    }

  # aws_s3_bucket.resume will be destroyed
  # (because aws_s3_bucket.resume is not in configuration)
  - resource "aws_s3_bucket" "resume" {
      - arn                         = "arn:aws:s3:::dbornitz-resume" -> null
      - bucket                      = "dbornitz-resume" -> null
      - bucket_domain_name          = "dbornitz-resume.s3.amazonaws.com" -> null
      - bucket_regional_domain_name = "dbornitz-resume.s3.us-east-2.amazonaws.com" -> null
      - force_destroy               = false -> null
      - hosted_zone_id              = "Z2O1EMRO9K5GLX" -> null
      - id                          = "dbornitz-resume" -> null
      - object_lock_enabled         = false -> null
      - policy                      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "s3:GetObject"
                      - Condition = {
                          - StringEquals = {
                              - "AWS:SourceArn" = "arn:aws:cloudfront::085879623427:distribution/E171XCBLMPI257"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "cloudfront.amazonaws.com"
                        }
                      - Resource  = "arn:aws:s3:::dbornitz-resume/*"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - region                      = "us-east-2" -> null
      - request_payer               = "BucketOwner" -> null
      - tags                        = {} -> null
      - tags_all                    = {} -> null
      - website_domain              = "s3-website.us-east-2.amazonaws.com" -> null
      - website_endpoint            = "dbornitz-resume.s3-website.us-east-2.amazonaws.com" -> null

      - grant {
          - id          = "78f4cb3fa6d9c93c08d0887b5897149d20cad7a55690247e92abab4ef403396e" -> null
          - permissions = [
              - "FULL_CONTROL",
            ] -> null
          - type        = "CanonicalUser" -> null
        }

      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = false -> null

              - apply_server_side_encryption_by_default {
                  - sse_algorithm = "AES256" -> null
                }
            }
        }

      - versioning {
          - enabled    = false -> null
          - mfa_delete = false -> null
        }

      - website {
          - error_document = "error.html" -> null
          - index_document = "index.html" -> null
        }
    }

  # aws_s3_bucket_policy.allow_cloudfront_access will be destroyed
  # (because aws_s3_bucket_policy.allow_cloudfront_access is not in configuration)
  - resource "aws_s3_bucket_policy" "allow_cloudfront_access" {
      - bucket = "dbornitz-resume" -> null
      - id     = "dbornitz-resume" -> null
      - policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "s3:GetObject"
                      - Condition = {
                          - StringEquals = {
                              - "AWS:SourceArn" = "arn:aws:cloudfront::085879623427:distribution/E171XCBLMPI257"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "cloudfront.amazonaws.com"
                        }
                      - Resource  = "arn:aws:s3:::dbornitz-resume/*"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
    }

  # aws_s3_bucket_public_access_block.resume will be destroyed
  # (because aws_s3_bucket_public_access_block.resume is not in configuration)
  - resource "aws_s3_bucket_public_access_block" "resume" {
      - block_public_acls       = false -> null
      - block_public_policy     = false -> null
      - bucket                  = "dbornitz-resume" -> null
      - id                      = "dbornitz-resume" -> null
      - ignore_public_acls      = false -> null
      - restrict_public_buckets = false -> null
    }

  # aws_s3_bucket_website_configuration.resume will be destroyed
  # (because aws_s3_bucket_website_configuration.resume is not in configuration)
  - resource "aws_s3_bucket_website_configuration" "resume" {
      - bucket           = "dbornitz-resume" -> null
      - id               = "dbornitz-resume" -> null
      - website_domain   = "s3-website.us-east-2.amazonaws.com" -> null
      - website_endpoint = "dbornitz-resume.s3-website.us-east-2.amazonaws.com" -> null

      - error_document {
          - key = "error.html" -> null
        }

      - index_document {
          - suffix = "index.html" -> null
        }
    }

  # aws_s3_object.resume_website["index.html"] will be destroyed
  # (because aws_s3_object.resume_website is not in configuration)
  - resource "aws_s3_object" "resume_website" {
      - bucket                 = "dbornitz-resume" -> null
      - bucket_key_enabled     = false -> null
      - cache_control          = "max-age=0" -> null
      - content_type           = "text/html" -> null
      - etag                   = "3e89b02d8c57705ba0985d12ba52858c" -> null
      - force_destroy          = false -> null
      - id                     = "index.html" -> null
      - key                    = "index.html" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./content/index.html" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
    }

  # aws_s3_object.resume_website["styles.css"] will be destroyed
  # (because aws_s3_object.resume_website is not in configuration)
  - resource "aws_s3_object" "resume_website" {
      - bucket                 = "dbornitz-resume" -> null
      - bucket_key_enabled     = false -> null
      - cache_control          = "max-age=0" -> null
      - content_type           = "text/css" -> null
      - etag                   = "90d0c830f4c2647dce0d2024a9e885e8" -> null
      - force_destroy          = false -> null
      - id                     = "styles.css" -> null
      - key                    = "styles.css" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./content/styles.css" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
    }

  # module.bucket-access["davidbornitz.dev"].data.aws_iam_policy_document.allow_cloudfront_access will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "allow_cloudfront_access" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + resources = [
              + (known after apply),
            ]

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + (known after apply),
                ]
              + variable = "AWS:SourceArn"
            }

          + principals {
              + identifiers = [
                  + "cloudfront.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # module.bucket-access["davidbornitz.dev"].aws_s3_bucket_policy.allow_cloudfront_access will be created
  + resource "aws_s3_bucket_policy" "allow_cloudfront_access" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = (known after apply)
    }

  # module.bucket-access["resume.davidbornitz.dev"].data.aws_iam_policy_document.allow_cloudfront_access will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "allow_cloudfront_access" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + resources = [
              + (known after apply),
            ]

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + (known after apply),
                ]
              + variable = "AWS:SourceArn"
            }

          + principals {
              + identifiers = [
                  + "cloudfront.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # module.bucket-access["resume.davidbornitz.dev"].aws_s3_bucket_policy.allow_cloudfront_access will be created
  + resource "aws_s3_bucket_policy" "allow_cloudfront_access" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = (known after apply)
    }

  # module.s3origin["davidbornitz.dev"].data.aws_iam_policy_document.allow_cloudfront_access will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "allow_cloudfront_access" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + resources = [
              + (known after apply),
            ]

          + principals {
              + identifiers = [
                  + "cloudfront.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # module.s3origin["davidbornitz.dev"].aws_s3_bucket.bucket will be created
  + resource "aws_s3_bucket" "bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "davidbornitz.dev"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule {
          + allowed_headers = (known after apply)
          + allowed_methods = (known after apply)
          + allowed_origins = (known after apply)
          + expose_headers  = (known after apply)
          + max_age_seconds = (known after apply)
        }

      + grant {
          + id          = (known after apply)
          + permissions = (known after apply)
          + type        = (known after apply)
          + uri         = (known after apply)
        }

      + lifecycle_rule {
          + abort_incomplete_multipart_upload_days = (known after apply)
          + enabled                                = (known after apply)
          + id                                     = (known after apply)
          + prefix                                 = (known after apply)
          + tags                                   = (known after apply)

          + expiration {
              + date                         = (known after apply)
              + days                         = (known after apply)
              + expired_object_delete_marker = (known after apply)
            }

          + noncurrent_version_expiration {
              + days = (known after apply)
            }

          + noncurrent_version_transition {
              + days          = (known after apply)
              + storage_class = (known after apply)
            }

          + transition {
              + date          = (known after apply)
              + days          = (known after apply)
              + storage_class = (known after apply)
            }
        }

      + logging {
          + target_bucket = (known after apply)
          + target_prefix = (known after apply)
        }

      + object_lock_configuration {
          + object_lock_enabled = (known after apply)

          + rule {
              + default_retention {
                  + days  = (known after apply)
                  + mode  = (known after apply)
                  + years = (known after apply)
                }
            }
        }

      + replication_configuration {
          + role = (known after apply)

          + rules {
              + delete_marker_replication_status = (known after apply)
              + id                               = (known after apply)
              + prefix                           = (known after apply)
              + priority                         = (known after apply)
              + status                           = (known after apply)

              + destination {
                  + account_id         = (known after apply)
                  + bucket             = (known after apply)
                  + replica_kms_key_id = (known after apply)
                  + storage_class      = (known after apply)

                  + access_control_translation {
                      + owner = (known after apply)
                    }

                  + metrics {
                      + minutes = (known after apply)
                      + status  = (known after apply)
                    }

                  + replication_time {
                      + minutes = (known after apply)
                      + status  = (known after apply)
                    }
                }

              + filter {
                  + prefix = (known after apply)
                  + tags   = (known after apply)
                }

              + source_selection_criteria {
                  + sse_kms_encrypted_objects {
                      + enabled = (known after apply)
                    }
                }
            }
        }

      + server_side_encryption_configuration {
          + rule {
              + bucket_key_enabled = (known after apply)

              + apply_server_side_encryption_by_default {
                  + kms_master_key_id = (known after apply)
                  + sse_algorithm     = (known after apply)
                }
            }
        }

      + versioning {
          + enabled    = (known after apply)
          + mfa_delete = (known after apply)
        }

      + website {
          + error_document           = (known after apply)
          + index_document           = (known after apply)
          + redirect_all_requests_to = (known after apply)
          + routing_rules            = (known after apply)
        }
    }

  # module.s3origin["davidbornitz.dev"].aws_s3_bucket_policy.allow_cloudfront_access will be created
  + resource "aws_s3_bucket_policy" "allow_cloudfront_access" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = (known after apply)
    }

  # module.s3origin["davidbornitz.dev"].aws_s3_bucket_website_configuration.website will be created
  + resource "aws_s3_bucket_website_configuration" "website" {
      + bucket           = (known after apply)
      + id               = (known after apply)
      + routing_rules    = (known after apply)
      + website_domain   = (known after apply)
      + website_endpoint = (known after apply)

      + error_document {
          + key = "error.html"
        }

      + index_document {
          + suffix = "index.html"
        }

      + routing_rule {
          + condition {
              + http_error_code_returned_equals = (known after apply)
              + key_prefix_equals               = (known after apply)
            }

          + redirect {
              + host_name               = (known after apply)
              + http_redirect_code      = (known after apply)
              + protocol                = (known after apply)
              + replace_key_prefix_with = (known after apply)
              + replace_key_with        = (known after apply)
            }
        }
    }

  # module.s3origin["resume.davidbornitz.dev"].data.aws_iam_policy_document.allow_cloudfront_access will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "allow_cloudfront_access" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + resources = [
              + (known after apply),
            ]

          + principals {
              + identifiers = [
                  + "cloudfront.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # module.s3origin["resume.davidbornitz.dev"].aws_s3_bucket.bucket will be created
  + resource "aws_s3_bucket" "bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "resume.davidbornitz.dev"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule {
          + allowed_headers = (known after apply)
          + allowed_methods = (known after apply)
          + allowed_origins = (known after apply)
          + expose_headers  = (known after apply)
          + max_age_seconds = (known after apply)
        }

      + grant {
          + id          = (known after apply)
          + permissions = (known after apply)
          + type        = (known after apply)
          + uri         = (known after apply)
        }

      + lifecycle_rule {
          + abort_incomplete_multipart_upload_days = (known after apply)
          + enabled                                = (known after apply)
          + id                                     = (known after apply)
          + prefix                                 = (known after apply)
          + tags                                   = (known after apply)

          + expiration {
              + date                         = (known after apply)
              + days                         = (known after apply)
              + expired_object_delete_marker = (known after apply)
            }

          + noncurrent_version_expiration {
              + days = (known after apply)
            }

          + noncurrent_version_transition {
              + days          = (known after apply)
              + storage_class = (known after apply)
            }

          + transition {
              + date          = (known after apply)
              + days          = (known after apply)
              + storage_class = (known after apply)
            }
        }

      + logging {
          + target_bucket = (known after apply)
          + target_prefix = (known after apply)
        }

      + object_lock_configuration {
          + object_lock_enabled = (known after apply)

          + rule {
              + default_retention {
                  + days  = (known after apply)
                  + mode  = (known after apply)
                  + years = (known after apply)
                }
            }
        }

      + replication_configuration {
          + role = (known after apply)

          + rules {
              + delete_marker_replication_status = (known after apply)
              + id                               = (known after apply)
              + prefix                           = (known after apply)
              + priority                         = (known after apply)
              + status                           = (known after apply)

              + destination {
                  + account_id         = (known after apply)
                  + bucket             = (known after apply)
                  + replica_kms_key_id = (known after apply)
                  + storage_class      = (known after apply)

                  + access_control_translation {
                      + owner = (known after apply)
                    }

                  + metrics {
                      + minutes = (known after apply)
                      + status  = (known after apply)
                    }

                  + replication_time {
                      + minutes = (known after apply)
                      + status  = (known after apply)
                    }
                }

              + filter {
                  + prefix = (known after apply)
                  + tags   = (known after apply)
                }

              + source_selection_criteria {
                  + sse_kms_encrypted_objects {
                      + enabled = (known after apply)
                    }
                }
            }
        }

      + server_side_encryption_configuration {
          + rule {
              + bucket_key_enabled = (known after apply)

              + apply_server_side_encryption_by_default {
                  + kms_master_key_id = (known after apply)
                  + sse_algorithm     = (known after apply)
                }
            }
        }

      + versioning {
          + enabled    = (known after apply)
          + mfa_delete = (known after apply)
        }

      + website {
          + error_document           = (known after apply)
          + index_document           = (known after apply)
          + redirect_all_requests_to = (known after apply)
          + routing_rules            = (known after apply)
        }
    }

  # module.s3origin["resume.davidbornitz.dev"].aws_s3_bucket_policy.allow_cloudfront_access will be created
  + resource "aws_s3_bucket_policy" "allow_cloudfront_access" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = (known after apply)
    }

  # module.s3origin["resume.davidbornitz.dev"].aws_s3_bucket_website_configuration.website will be created
  + resource "aws_s3_bucket_website_configuration" "website" {
      + bucket           = (known after apply)
      + id               = (known after apply)
      + routing_rules    = (known after apply)
      + website_domain   = (known after apply)
      + website_endpoint = (known after apply)

      + error_document {
          + key = "error.html"
        }

      + index_document {
          + suffix = "index.html"
        }

      + routing_rule {
          + condition {
              + http_error_code_returned_equals = (known after apply)
              + key_prefix_equals               = (known after apply)
            }

          + redirect {
              + host_name               = (known after apply)
              + http_redirect_code      = (known after apply)
              + protocol                = (known after apply)
              + replace_key_prefix_with = (known after apply)
              + replace_key_with        = (known after apply)
            }
        }
    }

Plan: 16 to add, 0 to change, 13 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>
*Pushed by: @davidbornitz, Action: `pull_request`*